### ordinal number encoding

category can be ordered in such a way that you can assign ranks

In [45]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

In [46]:
today_date= dt.datetime.today()

In [47]:
today_date

datetime.datetime(2020, 10, 9, 21, 39, 53, 157429)

In [48]:
for i in range(0,15):
    print(today_date - dt1.timedelta(i))

2020-10-09 21:39:53.157429
2020-10-08 21:39:53.157429
2020-10-07 21:39:53.157429
2020-10-06 21:39:53.157429
2020-10-05 21:39:53.157429
2020-10-04 21:39:53.157429
2020-10-03 21:39:53.157429
2020-10-02 21:39:53.157429
2020-10-01 21:39:53.157429
2020-09-30 21:39:53.157429
2020-09-29 21:39:53.157429
2020-09-28 21:39:53.157429
2020-09-27 21:39:53.157429
2020-09-26 21:39:53.157429
2020-09-25 21:39:53.157429

In [40]:
#using list comprehension

In [41]:
past_days = [today_date - dt1.timedelta(i) for i in range(0,15)]

In [42]:
past_days

[datetime.datetime(2020, 10, 9, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 8, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 7, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 6, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 5, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 4, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 3, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 2, 21, 39, 26, 235615),
 datetime.datetime(2020, 10, 1, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 30, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 29, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 28, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 27, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 26, 21, 39, 26, 235615),
 datetime.datetime(2020, 9, 25, 21, 39, 26, 235615)]

In [43]:
df = pd.DataFrame(past_days, columns=['Days'])

In [60]:
df['Day_name'] = df['Days'].dt.day_name()

In [61]:
df

                         Days   Day_name
0  2020-10-09 21:39:26.235615     Friday
1  2020-10-08 21:39:26.235615   Thursday
2  2020-10-07 21:39:26.235615  Wednesday
3  2020-10-06 21:39:26.235615    Tuesday
4  2020-10-05 21:39:26.235615     Monday
5  2020-10-04 21:39:26.235615     Sunday
6  2020-10-03 21:39:26.235615   Saturday
7  2020-10-02 21:39:26.235615     Friday
8  2020-10-01 21:39:26.235615   Thursday
9  2020-09-30 21:39:26.235615  Wednesday
10 2020-09-29 21:39:26.235615    Tuesday
11 2020-09-28 21:39:26.235615     Monday
12 2020-09-27 21:39:26.235615     Sunday
13 2020-09-26 21:39:26.235615   Saturday
14 2020-09-25 21:39:26.235615     Friday

In [62]:
dict ={'Monday':1, 'Tuesday':2, 'Wednesday':3, 'Thursday':4, 'Friday':5, 'Saturday':6, 'Sunday':7}

In [65]:
df['day_name_ordinal'] = df['Day_name'].map(dict)

In [66]:
df.head()

                        Days   Day_name  day_name_ordinal
0 2020-10-09 21:39:26.235615     Friday                 5
1 2020-10-08 21:39:26.235615   Thursday                 4
2 2020-10-07 21:39:26.235615  Wednesday                 3
3 2020-10-06 21:39:26.235615    Tuesday                 2
4 2020-10-05 21:39:26.235615     Monday                 1

## count or frequency encoding

In [80]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None, index_col=None) 
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [81]:
columns = [1,3,5,6,7,8,9,13]
train_set=train_set[columns]

In [82]:
train_set.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [86]:
train_set.columns = ['Employment', 'Degree','Status', 'Designation',
                     'Family_job','Race', 'Sex', 'country']

In [87]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [90]:
train_set.columns

Index(['Employment', 'Degree', 'Status', 'Designation', 'Family_job', 'Race',
       'Sex', 'country'],
      dtype='object')

In [101]:
len(train_set['Employment'].unique())

9

In [107]:
for feature in train_set.columns:
    print(feature,':',len(train_set[feature].unique()))

Employment : 9
Degree : 16
Status : 7
Designation : 15
Family_job : 6
Race : 5
Sex : 2
country : 42

In [111]:
dict1 = train_set['country'].value_counts().to_dict()

In [114]:
train_set['country_encoder'] = train_set['country'].map(dict1)

In [115]:
train_set.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,country,country_encoder
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,95

## target guided ordinal encoding

In [15]:
import pandas as pd

In [16]:
df = pd.read_csv('titanic.csv', usecols=['Survived', 'Cabin'])

In [17]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [18]:
df['Cabin'] = df['Cabin'].fillna('Missing')

In [19]:
df.head(20)

    Survived    Cabin
0          0  Missing
1          1      C85
2          1  Missing
3          1     C123
4          0  Missing
5          0  Missing
6          0      E46
7          0  Missing
8          1  Missing
9          1  Missing
10         1       G6
11         1     C103
12         0  Missing
13         0  Missing
14         0  Missing
15         1  Missing
16         0  Missing
17         1  Missing
18         0  Missing
19         1  Missing

In [31]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [32]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [37]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [38]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [39]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [49]:
for i in enumerate(ordinal_labels,0):
    print(i)

(0, 'T')
(1, 'M')
(2, 'A')
(3, 'G')
(4, 'C')
(5, 'F')
(6, 'B')
(7, 'E')
(8, 'D')

In [50]:
ordinal_encoding2 = {k:i for i,k in enumerate(ordinal_labels,0)}

In [51]:
ordinal_encoding2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [54]:
df['Cabin_encoded'] = df['Cabin'].map(ordinal_encoding2)

In [55]:
df.head(10)

   Survived Cabin  Cabin_encoded
0         0     M              1
1         1     C              4
2         1     M              1
3         1     C              4
4         0     M              1
5         0     M              1
6         0     E              7
7         0     M              1
8         1     M              1
9         1     M              1

# Mean encoding

In [59]:
dict1 = df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [60]:
df['mean_ordindal_encoding'] = df['Cabin'].map(dict1)

In [61]:
df.head(10)

   Survived Cabin  Cabin_encoded  mean_ordindal_encoding
0         0     M              1                0.299854
1         1     C              4                0.593220
2         1     M              1                0.299854
3         1     C              4                0.593220
4         0     M              1                0.299854
5         0     M              1                0.299854
6         0     E              7                0.750000
7         0     M              1                0.299854
8         1     M              1                0.299854
9         1     M              1                0.299854

### probablity ratio encoding

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv', usecols = ['Cabin', 'Survived'])

In [3]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [6]:
df['Cabin'] = df['Cabin'].fillna('missing')

In [7]:
df.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [12]:
df['Cabin']= df['Cabin'].astype(str).str[0]

In [14]:
df['Cabin'].unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [18]:
prob_df = df.groupby(['Cabin'])['Survived'].mean()

In [19]:
df2 = pd.DataFrame(prob_df)

In [20]:
df2

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
T      0.000000
m      0.299854

In [21]:
df2['Died'] = 1- df2['Survived']

In [22]:
df2

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000
F      0.615385  0.384615
G      0.500000  0.500000
T      0.000000  1.000000
m      0.299854  0.700146

In [23]:
df2['Prob_ratio'] = df2['Survived']/df2['Died']

In [24]:
df2

       Survived      Died  Prob_ratio
Cabin
A      0.466667  0.533333    0.875000
B      0.744681  0.255319    2.916667
C      0.593220  0.406780    1.458333
D      0.757576  0.242424    3.125000
E      0.750000  0.250000    3.000000
F      0.615385  0.384615    1.600000
G      0.500000  0.500000    1.000000
T      0.000000  1.000000    0.000000
m      0.299854  0.700146    0.428274

In [25]:
probablity_encoded = df2['Prob_ratio'].to_dict()

In [27]:
df['Cabin'] = df['Cabin'].map(probablity_encoded)

In [28]:
df

     Survived     Cabin
0           0  0.428274
1           1  1.458333
2           1  0.428274
3           1  1.458333
4           0  0.428274
..        ...       ...
886         0  0.428274
887         1  2.916667
888         0  0.428274
889         1  1.458333
890         0  0.428274

[891 rows x 2 columns]